# Apply Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintManager..::..Apply Method
PrintManager Class See Also
---
Apply the local print settings to global for all documents.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Apply()
```

Visual Basic
---
```text
Public Sub Apply
```

Visual C++
---
```text
public:
void Apply()
```

# Remarks
This method will change the settings for the current printer to match what is set in the Print Manager. When the user attempts to print with this printer in the future, the changes made by the API session will be visible.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when this operation is not allowed in the current application mode, or the print resource is occupied by others. |

# See Also
PrintManager Class
Autodesk.Revit.DB Namespace